IDENTIFICATION DIVISION.
PROGRAM-ID. ADD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01	A	PIC 9(1)V99 VALUE 2.25.
01	B	PIC 9(1)V99 VALUE 1.13.
01	C	PIC 9(1)V99 VALUE 1.45.
01	D	PIC 9(1) VALUE ZEROES.

PROCEDURE DIVISION.

	COMPUTE D = 7

	DISPLAY "VALUE OF D IS " D.

	STOP RUN.