IDENTIFICATION DIVISION.
PROGRAM-ID. COMPUTE.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01	A 	PIC 9(1) VALUE 2.
01	B 	PIC 9(1) VALUE 3.
01	C 	PIC 9(1) VALUE 1.
01	D 	PIC 9(1) VALUE ZEROES.

PROCEDURE DIVISION.

*>	COMPUTE D = B + A.

*>	COMPUTE D = B - 1.

*>	COMPUTE D = A * B.

*>	COMPUTE D = A / B.

*>	COMPUTE D = A ** B.
	
	COMPUTE D = 997.18 ON SIZE ERROR DISPLAY "THERE IS ERROR".

	DISPLAY "VALUE OF D IS " D.

	STOP RUN.