IDENTIFICATION DIVISION.
PROGRAM-ID. DIVIDE.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.

01	A PIC 999 VALUE 29.
01	B PIC 999 VALUE ZEROES.

01 VARIABLEC PIC 9999 VALUE ZEROES.

PROCEDURE DIVISION.
*>	DIVIDE  4 INTO A.

*>	DISPLAY A.

*>	DIVIDE A BY 4 GIVING B.

*>	DISPLAY A.
*>	DISPLAY B.

*>	COMPUTE B = A / 4

*>	DISPLAY A.
*>	DISPLAY B.
	
	DIVIDE A BY 5 GIVING B REMAINDER VARIABLEC.

	DISPLAY A.
	DISPLAY B.
	DISPLAY VARIABLEC.

	STOP RUN.