IDENTIFICATION DIVISION.
PROGRAM-ID. MULTIPLY.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01	A PIC 99V99 VALUE 31.88.
01	B PIC 999V99 VALUE 21.54.
01	c PIC 99999V99 VALUE ZEROES.

PROCEDURE DIVISION.
	
	MULTIPLY 43 BY B ON SIZE ERROR
				DISPLAY "THERE IS A SIZE ERROR"
			NOT ON SIZE ERROR
				DISPLAY "NO ERROR " B.

	MULTIPLY A BY B GIVING C ROUNDED.
	DISPLAY C.
	STOP RUN.