IDENTIFICATION DIVISION.
PROGRAM-ID. ORDER.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 ANSWER PIC 9(8) VALUE ZEROES.
PROCEDURE DIVISION.

*>	COMPUTE ANSWER = 5 + 3 - 2 ** 2 * 3 / 2 / 1 ** 3
	COMPUTE ANSWER = (5 + 3) - 2 ** (2 * 3 / 2 / 1) ** 3

	DISPLAY ANSWER.

	STOP RUN.