IDENTIFICATION DIVISION.
PROGRAM-ID. SUBTRACT.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01	A PIC 999 VALUE 66.
01	B PIC 999 VALUE 11.
01	C PIC 999 VALUE 10.
01	ANSWER PIC 9999 VALUE ZEROES.

PROCEDURE DIVISION.
	SUBTRACT 1 FROM A.

	SUBTRACT B C FROM A GIVING ANSWER.
	DISPLAY A.
	DISPLAY ANSWER.

	COMPUTE ANSWER = A - B - C.
	DISPLAY ANSWER.
	STOP RUN.