IDENTIFICATION DIVISION.
PROGRAM-ID. ASSIGNMENT1.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01	USER-NAME PIC X(20) VALUE ZEROES.
PROCEDURE DIVISION.
000-MAIN-PRODUCTION.
	PERFORM 100-ACCEPT-NAME.
	PERFORM 200-DISPLAY-NAME.
	STOP RUN.

100-ACCEPT-NAME.
	DISPLAY "PLEASE ENTER YOUR NAME: ".
	ACCEPT USER-NAME.

200-DISPLAY-NAME.
	DISPLAY "HELLO " USER-NAME.
