IDENTIFICATION DIVISION.
PROGRAM-ID. TABLE.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01	WEEK-TABLE	VALUE "MONDAY	TUESDAY	WEDNESDAY".
	05	DAY-NAME	PIC X(10) OCCURS 7 TIMES.
01	I	PIC 9(2) VALUES ZEROES.
PROCEDURE DIVISION.

	MOVE 'MONDAY' TO DAY-NAME(1).
	MOVE 'SUNDAY' TO DAY-NAME(7).

	PERFORM VARYING I FROM 1 BY 1 UNTIL I > 7
		DISPLAY DAY-NAME(I)
	END-PERFORM.

	STOP RUN.