IDENTIFICATION DIVISION.
PROGRAM-ID. CHARFUNC.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 I PIC 999 VALUE ZEROES.
PROCEDURE DIVISION.
	
	DISPLAY FUNCTION LENGTH("ABCDEFG").
	
	DISPLAY FUNCTION REVERSE("ABCDEFG").

	DISPLAY FUNCTION UPPER-CASE("abcdefg").

	DISPLAY FUNCTION LOWER-CASE("ABCDEFG").

	PERFORM UNTIL I > 256
		DISPLAY I " " FUNCTION CHAR(I)
		COMPUTE I = I + 1
	END-PERFORM.

	DISPLAY FUNCTION CHAR(95).

	DISPLAY FUNCTION ORD("$")
	

	STOP RUN.