IDENTIFICATION DIVISION.
PROGRAM-ID. FINANCFUNC.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 ANSWER PIC 9(6)V9(6) VALUE ZEROES.
PROCEDURE DIVISION.
	
	*>USED TO FIND THE INSTALLMENT VALUE FOR THE LOAD
	COMPUTE ANSWER = 1000 * FUNCTION ANNUITY(.08/12, 1). 

	DISPLAY ANSWER.

	*>USED TO FIND THE PRESENT VALUE FOR THE SERIES OF FUTURE PAYMENTS
	DISPLAY FUNCTION PRESENT-VALUE(.05/12 600).

	STOP RUN.