IDENTIFICATION DIVISION.
PROGRAM-ID. FINANCFUNC.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
	
	DISPLAY FUNCTION SIN(22).

	DISPLAY FUNCTION COS(180).

	DISPLAY FUNCTION TAN(1).

	DISPLAY FUNCTION ASIN(1).

	DISPLAY FUNCTION ACOS(180).

	DISPLAY FUNCTION ATAN(55).

	STOP RUN.