IDENTIFICATION DIVISION.
PROGRAM-ID. CONVERTING.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01	FULL-NAME	PIC X(60) VALUE "ABCDEFGHIJKLMNOP".
PROCEDURE DIVISION.

	INSPECT FULL-NAME
		CONVERTING	"ABCDEFGHIJKLMNOP"
		TO	"abcdefghijklmnop".

	DISPLAY FULL-NAME.

	STOP RUN.