IDENTIFICATION DIVISION.
PROGRAM-ID. INSPECT.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01	FULL-NAME	PIC 9(10) VALUE 0002432.

01	COUNTER1	PIC 9(3) VALUE ZEROES.
PROCEDURE DIVISION.

*>	INSPECT FULL-NAME
*>		TALLYING COUNTER1 FOR "A".

*>	INSPECT FULL-NAME
*>		TALLYING COUNTER1 FOR CHARACTERS AFTER " ".

*>	INSPECT FULL-NAME
*>		TALLYING COUNTER1 FOR ALL "O" AFTER "J".
	
	INSPECT FULL-NAME
		TALLYING COUNTER1 FOR LEADING "0".

	DISPLAY COUNTER1.

	STOP RUN.