IDENTIFICATION DIVISION.
PROGRAM-ID. REPLACE.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01	FULL-NAME	PIC 9(10).99 VALUE 0000231.93.
01	COUNTER1	PIC 9(2) VALUE ZEROES.
PROCEDURE DIVISION.


	
	INSPECT FULL-NAME
		TALLYING COUNTER1 FOR LEADING "0"
		REPLACE LEADING "0" BY "*".

	DISPLAY FULL-NAME.
	DISPLAY COUNTER1.
	STOP RUN.