IDENTIFICATION DIVISION.
PROGRAM-ID. IFELSE.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01	USER-AGE	PIC 9(3) VALUE ZEROES.
PROCEDURE DIVISION.
	
	DISPLAY "PLEASE ENTER YOUR AGE: ".
	ACCEPT USER-AGE.

	IF NOT USER-AGE <= 18
		DISPLAY "YOU ARE AN ADULT"
	ELSE
		DISPLAY "YOU ARE A CHILD"
	END-IF.

	STOP RUN.