IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORMAFTER.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01	I	PIC 9(2) VALUE ZEROES.
01	J	PIC 9(2) VALUE ZEROES.
PROCEDURE DIVISION.

	PERFORM WITH TEST AFTER
		VARYING I FROM 1 BY 1
		UNTIL I = 5
		DISPLAY "HELLO WORLD AFTER"
	END-PERFORM.

	PERFORM WITH TEST BEFORE
		VARYING J FROM 1 BY 1
		UNTIL J = 5
		DISPLAY "HELLO WORLD BEFORE"
	END-PERFORM.

	STOP RUN.
