IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORMUNTIL.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01	I PIC 9(2) VALUE ZEROES.
01	USER-NAME PIC X(20) VALUE SPACES.
PROCEDURE DIVISION.
MAIN-PROCEDURE.

000-MAIN-PROCEDURE.
	PERFORM 100-DISPLAY-HELLO UNTIL I > 10.
	PERFORM 200-DISPLAY-NAME UNTIL USER-NAME = 0.
	STOP RUN.
	
100-DISPLAY-HELLO.
	DISPLAY "Hello world"
	COMPUTE I = I + 1.

200-DISPLAY-NAME.
	ACCEPT USER-NAME.
	DISPLAY "Hello " USER-NAME.