IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORMTIMES.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01	NO-OF-TIMES PIC 9(2) VALUE ZEROES.
PROCEDURE DIVISION.
MAIN-PROCEDURE.
	
	ACCEPT NO-OF-TIMES.
	PERFORM 100-DISPLAY-HELLO NO-OF-TIMES TIMES.
	STOP RUN.

	100-DISPLAY-HELLO.
		DISPLAY "HELLO WORLD".
