IDENTIFICATION DIVISION.
PROGRAM-ID. VARYPERFORM.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01	NO-OF-TIMES PIC 9(2) VALUE ZEROES.
PROCEDURE DIVISION.
MAIN-PROCEDURE.
	
	PERFORM 100-DISPLAY-HELLO
		VARYING NO-OF-TIMES FROM 1 BY 3
			UNTIL NO-OF-TIMES > 3
	STOP RUN.
	
	100-DISPLAY-HELLO.
		DISPLAY "HELLO WORLD".
